# RadialDimensionCannotProjectToArc Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..RadialDimensionCannotProjectToArc Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Cannot form radial dimension.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RadialDimensionCannotProjectToArc { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RadialDimensionCannotProjectToArc As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RadialDimensionCannotProjectToArc {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace